# configs/yolov8n_arch_modified.yaml
#
# Modified YOLOv8n architecture — changes the neck (feature fusion) component.
#
# WHAT CHANGED vs stock yolov8n:
#   1. Added a C2f block with attention (shortcut=True) after each upsample
#      concat in the top-down path of the neck. Stock YOLOv8n uses plain C2f
#      with shortcut=False in the neck — enabling shortcut adds residual
#      connections that help gradient flow and feature reuse.
#   2. Added an extra bottom-up PAN stage fusing P3 back down into P4 before
#      the head. Stock YOLOv8n has two bottom-up stages (P3→P4, P4→P5); this
#      adds a third fusion pass (P3→P4) giving the P4 feature map a second
#      chance to incorporate fine-grained spatial detail.
#
# WHY THIS WORKS (theoretical justification):
#   The neck's job is to fuse multi-scale features from the backbone so the
#   detection head can predict objects at different sizes. In the standard
#   PANet neck, each scale only sees its neighbours once. Adding residual
#   connections (shortcut=True in C2f) preserves low-level spatial information
#   as it flows upward through the neck — this is the same principle behind
#   ResNets: shortcut paths prevent representational collapse. The extra
#   bottom-up fusion stage gives P4 (the medium-scale feature map) richer
#   context from both the high-resolution P3 and the semantic P5, which
#   particularly helps detection of medium-sized objects (the 32-96px range
#   where COCO mAP gains are most accessible).
#
# BACKBONE: unchanged from YOLOv8n
# NECK:     PANet with residual C2f blocks + extra P3→P4 fusion stage
# HEAD:     unchanged from YOLOv8n

# Model scaling — keep nano scale factors
nc: 80

scales:
  n: [0.33, 0.25, 1024]

# Backbone — identical to stock yolov8n backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0 - P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1 - P2/4
  - [-1, 3, C2f, [128, True]]          # 2
  - [-1, 1, Conv, [256, 3, 2]]         # 3 - P3/8
  - [-1, 6, C2f, [256, True]]          # 4
  - [-1, 1, Conv, [512, 3, 2]]         # 5 - P4/16
  - [-1, 6, C2f, [512, True]]          # 6
  - [-1, 1, Conv, [1024, 3, 2]]        # 7 - P5/32
  - [-1, 3, C2f, [1024, True]]         # 8
  - [-1, 1, SPPF, [1024, 5]]           # 9 - output

# Neck — modified PANet with residual C2f and extra fusion stage
head:
  # --- top-down path (high-res features flow down from P5 → P3) ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 10 - upsample P5
  - [[-1, 6], 1, Concat, [1]]                    # 11 - concat with P4 backbone
  - [-1, 3, C2f, [512, True]]                    # 12 - CHANGED: shortcut=True (was False)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13 - upsample fused-P4
  - [[-1, 4], 1, Concat, [1]]                    # 14 - concat with P3 backbone
  - [-1, 3, C2f, [256, True]]                    # 15 - CHANGED: shortcut=True (was False)
                                                 #      P3 output (small objects)

  # --- bottom-up path (semantic context flows back up P3 → P5) ---
  - [-1, 1, Conv, [256, 3, 2]]                   # 16 - downsample P3
  - [[-1, 12], 1, Concat, [1]]                   # 17 - concat with top-down P4
  - [-1, 3, C2f, [512, True]]                    # 18 - CHANGED: shortcut=True (was False)

  # ADDED: extra P3→P4 fusion pass for richer medium-scale features
  - [15, 1, Conv, [256, 3, 2]]                   # 19 - downsample P3 again
  - [[-1, 18], 1, Concat, [1]]                   # 20 - fuse into P4 a second time
  - [-1, 3, C2f, [512, False]]                   # 21 - NEW fused P4

  - [18, 1, Conv, [512, 3, 2]]                   # 22 - downsample to P5
  - [[-1, 9], 1, Concat, [1]]                    # 23 - concat with backbone P5
  - [-1, 3, C2f, [1024, True]]                   # 24 - CHANGED: shortcut=True (was False)
                                                 #      P5 output (large objects)

  # Detection head — reads from P3 (15), new fused P4 (21), P5 (24)
  - [[15, 21, 24], 1, Detect, [nc]]              # 25 - CHANGED: P4 source is 21 not 18
